<script setup>
    import {ref} from 'vue'
    import Tabs from "../Tabs/Tabs.vue"
    import Accordion from "../Accordion/Accordion.vue"
    import AccordionItem from "../Accordion/AccordionItem.vue"

    const tabs = [
        {name: '1', label: 'Финансовые'},
        {name: '2', label: 'Продукт'},
        {name: '3', label: 'Открытие кофейни'},
        {name: '4', label: 'Риски и гарантии'},
        {name: '5', label: 'Мастер-франшиза'},
        {name: '6', label: 'Инвестиционный франчайзинг'},
        {name: '7', label: 'Ребрендинг'}
    ]

    const selectedTab = ref('1')

    const changeTab = (tabName) => {
        selectedTab.value = tabName
    }
</script>

<template>
    <section class="faq mb-page">
        <div class="container">
            <div class="wrapper-page mb-4">
                <h2>Вопрос-ответ</h2>
            </div>
            <Tabs 
                :names="tabs"
                :selectedTab="selectedTab"
                @changeTab="changeTab"
                >
                <Accordion v-if="selectedTab === '1'">
                    <AccordionItem title="Почему такие большие инвестиции?">
                        У Cofix есть стандарты оснащения кофейни, включающие в себя перечень торгового, технологического и IT-оборудований, а также критерии качества материалов, мебельных конструкций и вывесок. Это позволяет оказывать посетителям бесперебойный сервис, соответствующий уровню международного бренда.
                    </AccordionItem>
                    <AccordionItem title="Что входит в объем инвестиций?">
                        В общий объем инвестиций мы включаем все расходы, которые необходимы при открытии кофейни и в процессе её выхода на точку безубыточности. Сюда входит паушальный взнос, стоимость оборудования и мебели, ремонтные работы, закупка продукции, расходных материалов, мелкоштучного инвентаря, депозит по аренде, оплата первого месяца аренды и потери первых месяцев (сумма на поддержание работы кофейни до ее выхода на точку безубыточности).
                    </AccordionItem>
                    <AccordionItem title="Что входит в паушальный взнос?">
                        Паушальный взнос – это плата за работу под брендом на закрепленной территории, а не консалтинговая услуга.<br>В Cofix паушальный взнос покрывает услуги по поиску и согласованию помещений для открытия кофеен, проектирование, строительство кофеен «под ключ», подбор и обучение персонала, обучение партнера ведению бизнеса, оформление необходимых разрешительных документов, централизованные закупки, подключение к единой кассовой и учетной системам.
                    </AccordionItem>
                    <AccordionItem title="Почему такая долгая окупаемость?">
                        В расчете срока возврата инвестиций мы учитываем все расходы, которые партнеру необходимо понести на старте – от паушального взноса до потерь первых месяцев, а также учитываем сезонность бизнеса и Ramp-Up Period (около 6 мес.) – срок от открытия до момента, когда кофейня нарабатывает собственную базу лояльных постоянных гостей и выходит на целевые показатели бизнеса. С учетом этих вводных срок возврата инвестиций в диапазоне от 18 до 32 месяцев соответствует текущим экономическим реалиям и в связке со сроком арендного договора дает доходность в размере от 30% годовых.
                    </AccordionItem>
                    <AccordionItem title="Какая чистая прибыль и выручка в среднем по кофейням?">
                        В зависимости от формата кофейни выручка находится в диапазоне от 800 000 до 5 800 000 рублей в месяц. Чистая прибыль в среднем от 10% до 28% от выручки, что в денежном эквиваленте составляет от 250 000 до 1 500 000 рублей в месяц.
                    </AccordionItem>
                </Accordion>
                <Accordion v-if="selectedTab === '2'">
                    <AccordionItem title="Какая себестоимость продукции?">
                        Себестоимость продукции (фудкост) составляет по Москве и Московской области 36% (с учетом доставки и расходных материалов). Для регионов рассчитывается индивидуально с учетом стоимости логистики.
                    </AccordionItem>
                    <AccordionItem title="Как я могу ознакомиться с закупочными ценами на продукцию?">
                        Детальный прайс-лист отображается у партнеров в системе при размещении заказов на продукцию. Управление себестоимостью – одна из основных задач управляющей компании, которая позволит снизить с персонала/партнера/сотрудников операционную нагрузку на взаимодействие с поставщиками и даст возможность сконцентрироваться  на рабочих процессах и основных задачах. COFIX, в свою очередь, гарантирует своевременную поставку продукции, ингредиентов для приготовления напитков и расходного материала для всех кофеен сети.
                    </AccordionItem>
                    <AccordionItem title="Кто является производителем продукции?">
                        У Cofix более 80 поставщиков различных ингредиентов и готовой продукции, которые поставляются в кофейни единым 4PL-оператором логистики. Бленд кофейного зерна Cofix обжаривается на собственном заводе в Московской области и поставляется в кофейни. Cofix самостоятельно управляет цепочками поставок. Партнерам оказывается сервис централизованных поставок: заказ всей продукции делается в одной форме и доставляется в кофейню по заранее согласованному графику.
                    </AccordionItem>
                    <AccordionItem title="Могу ли я добавить свои позиции в меню?">
                        Такая опция не предусмотрена. Если есть предложения или интересные идеи по ассортименту, согласование происходит через отдел по работе с продуктом.
                    </AccordionItem>
                </Accordion>
                <Accordion v-if="selectedTab === '3'">
                    <AccordionItem title="В каком городе можно открыть кофейню?">
                        Мы рассматриваем к открытию все города с численностью населения от 150000 человек.
                    </AccordionItem>
                    <AccordionItem title="Срок открытия кофейни?">
                        От подписания договора аренды до открытия в среднем требуется 40-45 дней.
                    </AccordionItem>
                    <AccordionItem title="Каким образом вы оцениваете потенциал локации?">
                        Бизнес-модель работает эффективно в помещениях с интенсивным и стабильным трафиком, поэтому этот параметр является одним из самых важных при оценке. Мы анализируем качество трафика, насколько много рядом целевой аудитории, смотрим конкурентное окружение и их результаты работы. Проверяем перспективы работы, возможности увеличения потока гостей или его снижения в обозримом будущем. Помимо этого, мы ориентируемся на результаты работы действующих кофеен сети с похожим трафиком, форматом и расположением.
                    </AccordionItem>
                    <AccordionItem title="Могу ли я самостоятельно выполнить строительные работы?">
                        Мы допускаем выполнение СМР подрядчиком партнера в случае наличия у подрядчика подтвержденной экспертизы по строительству аналогичных объектов при предоставлении коммерческого предложения, соответствующего срокам и объему проводимых работ, а также при наличии финансовой экономии для партнера.
                    </AccordionItem>
                    <AccordionItem title="Сколько времени я буду тратить на управление кофейней?">
                        Точное количество времени обозначить сложно. Вовлеченность собственника в операционные процессы необходима для эффективной работы кофейни, но это не предполагает ежедневное присутствие. Доля контроля для управления доступна в удаленном формате (видеонаблюдение, программа IIKO, платформа Cofix Business, коммуникации с управляющим). Большинство наших партнеров имеют дополнительные виды бизнеса и могут планировать время, чтобы его было достаточно для качественной работы во всех направлениях.
                    </AccordionItem>
                </Accordion>
                <Accordion v-if="selectedTab === '4'">
                    <AccordionItem title="Чем вы отличаетесь от других кофейных франшиз?">
                        У нас достаточно много отличий. Во-первых, Cofix строит на 99% франчайзинговый бизнес, открывая только партнерские точки. Это означает отсутствие конкуренции между собственными (корпоративными) кофейнями и кофейнями наших партнеров и то, что работа всей нашей команды направлена на развитие и усовершенствование бизнес-процессов, которые наши партнеры применяют в работе. Во-вторых, Cofix имеет более чем десятилетний международный опыт работы на кофейном рынке и практически семилетний опыт работы в России. Это значит, что мы как бренд прошли самые сложные периоды, в том числе пандемию и, получив необходимый опыт, транслируем его на всю нашу большую сеть. Мы стабильно занимаем самые высокие места в независимых рейтингах (Forbes, РБК, Food Service, Allegra Café Europe и др.), что безусловно говорит о силе бренда и успешности самой франшизы.
                    </AccordionItem>
                    <AccordionItem title="Какую поддержку вы оказываете?">
                        Компания оказывает комплексную поддержку на всех этапах работы с кофейней: помощь в поиске и экспертной оценке локации, переговоры с арендодателями и юридическая оценка договоров, подбор и обучение персонала и партнера, организация всех необходимых работ по строительству кофейни (бизнес «под ключ»), подключение к ИТ-системам и общей сетевой автоматизации. Помимо этого, мы закрепляем за кофейней территориального управляющего от компании, который будет помогать в решении вопросов в операционной деятельности на постоянной основе. К коммуникациям с работающими точками также подключается отдел B2B, который регулярно контролирует эффективность кофейни и предоставляет рекомендации для повышения показателей выручки.
                    </AccordionItem>
                    <AccordionItem title="Какие гарантии того, что бизнес с вами будет успешным?">
                        Покупка франшизы Cofix не дает 100% гарантий успеха, но отработанные годами бизнес-процессы, узнаваемость бренда, уникальность нашей бизнес-модели и рост кофейного рынка позволяют минимизировать риски, с которыми сталкивается каждый предприниматель, открывающий бизнес «с нуля».
                    </AccordionItem>
                    <AccordionItem title="Можно ли пообщаться с действующими партнерами?">
                        Мы готовы предоставить такую возможность на этапе подписания договора. До этого момента мы сами предоставим вам всю необходимую информацию, чтобы общение с действующим партнером в дальнейшем только укрепило вас в желании сотрудничества с нашей компанией.
                    </AccordionItem>
                    <AccordionItem title="Сколько было закрытий из-за нерентабельности? (Случаются ли закрытия кофеен из-за нерентабельности?)">
                        Как и в любом бизнесе, не все кофейни Cofix являются прибыльными. На падение выручки влияют множество факторов, таких как ротация или закрытие якорных арендаторов в торговом центре, снижение трафика рядом с кофейней по причине ремонта (ближайшего входа в метро/перехода/тротуара/фасада и прочее), ограничительные меры и прочее. Преимущество работы по франшизе Cofix заключается в том, что мы отслеживаем снижение продаж и изучаем, какие причины на это влияют, затем совместно с партнером разрабатываем мероприятия, позволяющие рассчитывать на увеличение товарооборота.
                    </AccordionItem>
                </Accordion>
                <Accordion v-if="selectedTab === '5'">
                    <AccordionItem title="Как стать мастер-франчайзи?">
                        Подтверждение возможности работы в таком формате проходит несколько этапов. Выбранный партнером регион должен иметь потенциал для развития сети кофеен, в первую очередь, по численности постоянного населения (приоритетными являются города-миллионники). Совместно с партнером мы определяем количество и форматы кофеен, которые позволят достойно представить бренд в новом регионе. От партнера необходима готовность открыть первые кофейни в корпоративном формате, далее к развитию можно будет подключить субфранчайзи. Наличие действующих ресурсов для управления сети кофеен (фабрики-кухни, штат персонала) является существенным преимуществом, так как позволит более оперативно и качественно занять конкурентоспособное место на локальном рынке.
                    </AccordionItem>
                    <AccordionItem title="Какой бюджет инвестиций требуется?">
                        Подтверждение возможности работы в таком формате проходит несколько этапов. Выбранный партнером регион должен иметь потенциал для развития сети кофеен, в первую очередь, по численности постоянного населения (приоритетными являются города-миллионники). Совместно с партнером мы определяем количество и форматы кофеен, которые позволят достойно представить бренд в новом регионе. От партнера необходима готовность открыть первые кофейни в корпоративном формате, далее к развитию можно будет подключить субфранчайзи. Наличие действующих ресурсов для управления сети кофеен (фабрики-кухни, штат персонала) является существенным преимуществом, так как позволит более оперативно и качественно занять конкурентоспособное место на локальном рынке.
                    </AccordionItem>
                </Accordion>
                <Accordion v-if="selectedTab === '6'">
                    <AccordionItem title="Какая схема работы в формате инвестиций?">
                        Формат инвестиционного франчайзинга предполагает меньшую вовлеченность партнера в рабочие процессы относительно стандартной франшизы. Помимо основных договоров, мы дополнительно подписываем с партнёрами агентский договор на операционное управление кофейней нашей компанией. Партнер имеет возможность принимать участие в выборе локации и будет полноценным собственником бизнеса. При этом все основные задачи, связанные с процессами по открытию и операционным управлением, будут в зоне ответственности Cofix. Компания будет регулярно отчитываться о результатах работы и предоставлять партнеру возможность получать ежемесячную прибыль. За операционное управление будет производиться оплата в размере 4% от выручки (дополнительно к стандартным платежам).
                    </AccordionItem>
                    <AccordionItem title="Какой бюджет инвестиций является минимальным?">
                        Мы рекомендуем воспользоваться таким форматом сотрудничества при готовности открыть 3 и более кофейни, так как это позволит оптимизировать затраты на управление и снизит нагрузку на финансовую модель. Ориентировочный бюджет на открытие каждой кофейни составляет 6 000 000 рублей и во многом зависит от выбранных локаций.
                    </AccordionItem>
                </Accordion>
                <Accordion v-if="selectedTab === '7'">
                    <AccordionItem title="Какие инвестиции могут потребоваться для ребрендинга?">
                        Объем инвестиций значительно ниже, чем при открытии кофейни «с нуля». Это обусловлено тем, что при проектировании мы сохраним максимальное количество технологического оборудования (холодильники, морозильники, холодильные столы и прочее), использующегося в вашей кофейне. В денежном эквиваленте максимальный объем инвестиций составит до 2 000 000-3 000 000 рублей, включая арендные депозиты и операционные расходы.
                    </AccordionItem>
                    <AccordionItem title="Сколько времени занимает процесс ребрендинга?">
                        Срок запуска кофейни после ребрендинга составляет около месяца. Это время требуется для проектирования кофейни, поиска и обучения персонала, строительно-монтажных работ и закупки недостающего оборудования.
                    </AccordionItem>
                    <AccordionItem title="В чем отличие ребрендинга от стандартной франшизы?">
                        Ребрендинг – это предложение только для владельцев действующих кофеен, которым присоединение к бренду Cofix поможет увеличить прибыльность бизнеса за счет роста выручки, благодаря узнаваемости бренда на рынке, маркетинговым активностям, качественно обученным сотрудникам, сбалансированному и постоянно улучшающемуся меню и другим преимуществам.
                    </AccordionItem>
                </Accordion>
            </Tabs>
        </div>
    </section>
</template>

<style lang="scss" scoped>

</style>